A=[0 1 0;0 0 1;-6 -11 -6];
B=[0;0;1];
C=[6 0 0];
D=[0];
x0=[1;0;-1];
t=0:0.01:99;
u=sin(t);
%设定系统初值
[num,den]=ss2tf(A,B,C,D);
%计算系统的解析解

sys=ss(A,B,C,D);
[y1,x1,T1]=initial(A,B,C,D,x0);
[y2,T2,x2]=lsim(sys,u,t,x0);
%计算系统在初始条件下的状态响应和输出响应
%计算系统在脉冲函数作用下的状态响应和输出响应

figure(1);uitable('daTa',[num;den],'RowName',['num';'den']);
%列表表示状态方程的解析解
figure(2);plot(T1,x1(:,1),T1,x1(:,2),T1,x1(:,3));
legend('x1状态响应','x2状态响应','x3状态曲线');

%绘制系统初始条件下的状态响应曲线
figure(3);uitable('daTa',[x1(:,1),x1(:,2),x1(:,3),y1],'ColumnName',['状态响应';'状态响应';'状态响应';'输出响应']);
%列表表示初始状态作用下状态响应和输出响应的数值解
figure(4);plot(T1,x1(:,1),T1,x1(:,2),T1,x1(:,3),T1,y1);
legend('x1状态响应','x2状态响应','x3状态响应曲线','系统输出曲线');
%绘制系统的初始状态作用下的状态响应曲线和系统输出曲线
figure(5);plot3(x1(:,1),x1(:,2),x1(:,3));
%绘制初始状态下的系统状态轨迹

figure(6);plot(T1,x1(:,1),T1,x1(:,2),T1,x1(:,3));
legend('x1状态响应','x2状态响应','x3状态响应');
%绘制系统脉冲函数下的状态响应曲线
figure(7);uitable('daTa',[x2(:,1),x2(:,2),x2(:,3),y2],'ColumnName',['状态响应';'状态响应';'状态响应';'输出响应']);
%列表表示初始状态作用下状态响应和输出响应的数值解
figure(8);plot(T2,x2(:,1),T2,x2(:,2),T2,x2(:,3),T2,y2);
legend('x1状态响应','x2状态响应','x3状态响应','系统输出曲线');
%绘制系统的初始状态作用下的状态响应曲线和系统输出曲线
figure(9);plot3(x2(:,1),x2(:,2),x2(:,3));

%绘制初始状态下的系统状态轨迹